{
    "score": 95,
    "title": "화염과 화살의 만남, 최고의 모험과 열정의 궁합",
    "summary": "양자리(Aries)와 사수자리(Sagittarius)는 모두 '불(Fire)'의 별자리이자, **모험과 자유**를 상징하는 별자리입니다. 이들은 서로의 열정과 이상을 이해하는 **황도 12궁 내 최고의 궁합 중 하나**입니다.\n\n양자리는 '지금 당장' 시작할 수 있는 용기를, 사수자리는 '더 넓은 세상'에 대한 비전을 제공합니다. 이들은 서로에게 끊임없는 영감과 에너지를 제공하며, 자유를 보장하는 쿨한 관계를 유지합니다. 단점은 너무 '솔직함'으로 인해 상처를 주고받거나, 무계획적인 지출로 재정 문제가 생길 수 있다는 점입니다.",
    
    "analysis": {
        "strengths": [
            "강력한 '불'의 시너지: 둘 다 열정, 긍정, 에너지가 넘쳐서 관계가 활기차고 역동적입니다. 지루할 틈이 없습니다.",
            "자유와 독립성 존중: 서로의 개인적인 공간과 독립적인 활동을 완벽하게 존중합니다. 소유욕이나 집착이 거의 없습니다.",
            "지적/모험적 연결: 사수자리의 철학적이고 이상적인 사고방식은 양자리의 탐험 욕구를 자극하고, 함께 세계를 배우고 여행합니다."
        ],
        "weaknesses": [
            "지나친 솔직함: 사수자리의 필터 없는 '직설적인 말'은 양자리의 자존심에 상처를 줄 수 있습니다. 싸움의 원인은 대부분 '말' 때문입니다.",
            "무계획성: 둘 다 미래의 결과나 재정적인 안정을 고려하지 않고 현재의 재미와 충동에 따라 행동하기 쉽습니다. 돈 관리에 취약합니다.",
            "감정적인 깊이 회피: 문제가 생기면 심각하게 파고들기보다 '괜찮다'고 외면하거나 유머로 넘기려 합니다. 진정한 감정적 교류가 부족해질 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '함께하는 시간'(모험적인 활동)과 '긍정의 말'(칭찬)을 원합니다. 사수자리는 가끔 '선물'(여행 관련)을 통해 기쁨을 표현합니다. 서로의 자유를 보장하는 것이 최고의 애정 표현입니다.",
        "conflictStyle": "싸우자마자 즉시 화해하는 '단발성 폭발'입니다. 감정을 숨기지 않고 격렬하게 토론하지만, 뒤끝이 없고 빠르게 잊어버립니다. 단, 사수자리가 '내가 더 현명하다'는 식의 태도를 보이면 양자리가 격분할 수 있습니다.",
        "relationshipGoals": "세계 탐험, 새로운 지식 탐구, 그리고 끊임없이 성장하는 것. 결혼이나 정착보다는 '함께하는 모험'을 우선시합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "양자리(MY)가 기억해야 할 조언: 귀를 열어라",
        "forMyType_Tips": [
            "사수자리의 직설적인 비판이나 잔소리를 '나를 미워해서'가 아니라 '나를 성장시키려는 조언'으로 받아들이세요.",
            "당신의 에너지를 사수자리의 '철학적' 주제에 집중해 보세요. 그들과 함께 지적인 대화를 나누면 관계가 깊어집니다.",
            "재정적인 안정성을 위해, 사수자리의 충동적인 지출을 '재미있는 게임'처럼 관리하도록 유도하세요."
        ],
        "forPartnerType_Header": "사수자리(PARTNER)가 기억해야 할 조언: 말에 필터를 씌워라",
        "forPartnerType_Tips": [
            "양자리의 '자존심'은 그들의 엔진입니다. 비판할 때는 반드시 '칭찬' 한 스푼과 함께 주어야 합니다.",
            "양자리의 '즉각적인 행동력'을 높이 평가하고 인정하세요. 당신이 생각만 하는 것을 그들은 이미 실행하고 있습니다.",
            "둘이 함께 있을 때, 가끔은 '오늘 당신이 리드하고 싶은 대로 해'라며 양자리의 주도권을 인정해 주어야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "최고의 '여행 가이드'와 '탐험가' 팀. 사수자리가 '새로운 목적지'와 '문화적 배경'을 연구하고, 양자리가 그곳으로 '돌진'하여 길을 개척합니다.",
        "onAVacation": "계획에 없던 곳으로 떠나는 '즉흥적인 장거리 여행'을 선호합니다. 사수자리가 새로운 문화적 경험을 찾고 양자리가 스포츠나 액티비티를 즐깁니다.",
        "asParents": "아이에게 세상에 대한 호기심과 높은 이상을 심어주는 부모입니다. 아이의 독립심을 가장 먼저 존중합니다."
    }
}
