{
    "score": 70,
    "title": "화염 방사기 커플, 불꽃 같은 열정과 자존심의 충돌",
    "summary": "두 양자리가 만났을 때, 연애는 지루할 틈 없는 폭발적인 축제와 같습니다. 양자리(Aries)는 황도 12궁의 첫 번째 별자리로, 순수한 열정, 직진, 그리고 강력한 리더십을 상징합니다. 두 사람이 만나면 에너지가 넘치고, 새로운 도전을 두려워하지 않는 '행동파' 커플이 됩니다.\n\n하지만 이 넘치는 에너지가 종종 **'주도권 싸움'**과 **'충동적인 결정'**으로 이어질 수 있습니다. 누가 더 잘났는지, 오늘은 누가 이끌 것인지에 대한 사소한 경쟁이 관계를 지치게 만들 수 있습니다. 싸움을 '경쟁'으로 즐길 수 있다면 관계가 유지됩니다.",
    
    "analysis": {
        "strengths": [
            "에너지가 넘치고 관계 발전 속도가 빠릅니다. 연애 시작부터 결혼까지 초고속으로 진행될 수 있습니다. 심지어 오늘 만나 내일 동거를 결정할 수도 있습니다.",
            "서로의 독립성과 열정을 인정합니다. 상대방의 취미나 사회 활동을 구속하지 않고, 오히려 서로의 성과에 대해 자랑스러워합니다.",
            "문제를 회피하지 않고 즉각적으로 해결하려 합니다. 뒤끝이 없고 쿨한 관계 유지가 가능하여, 감정을 묵혀두는 일은 절대 없습니다."
        ],
        "weaknesses": [
            "주도권 싸움이 잦고 충동적인 결정을 내리기 쉽습니다. 특히 금전적인 부분에서 '일단 지르고 보자'는 태도가 위험합니다.",
            "둘 다 '듣는 것'보다 '말하는 것'을 좋아해, 중요한 순간에 서로의 말을 끊거나 경청하지 않아 오해가 깊어질 수 있습니다.",
            "인내심이 부족하여, 관계에 어려움이 닥치면 쉽게 지치거나 포기하려는 경향이 있습니다. 관계 회복을 위한 끈기가 부족합니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "두 유형 모두 '긍정의 말(Words of Affirmation)'과 '선물(Gifts - 특히 액티비티 관련 장비)'을 선호합니다. '나는 너의 열정을 믿어'라는 말과 함께 서핑 장비를 선물하면 최고의 사랑 표현이 될 것입니다. 육체적인 스킨십도 매우 중요하게 여깁니다.",
        "conflictStyle": "정면충돌 후 즉시 화해하는 쿨한 타입입니다. 감정을 폭발시키고, 싸움이 끝나면 '왜 싸웠지?' 싶을 정도로 빠르게 잊어버립니다. 다만, 싸움의 주제가 '자존심'이었다면 장기화될 수 있으니 주의해야 합니다.",
        "relationshipGoals": "새로운 도전을 함께하고 모험적인 삶을 사는 것. 단순한 안정보다는 '끊임없이 성장하는 관계'를 목표로 합니다. 함께 창업하거나 세계 일주 같은 원대한 계획을 세우는 것을 좋아합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "양자리(MY)가 기억해야 할 조언: 멈춤의 미학",
        "forMyType_Tips": [
            "상대방의 작은 승리에도 크게 칭찬하여 자존심을 세워주세요. '네가 최고야'라는 말 한마디가 모든 갈등을 해소할 수 있습니다.",
            "상대방의 의견에 무작정 '돌진'하기 전에 3초만 멈추고 들어보세요. 당신의 즉흥적인 결정이 상대방에게는 무시로 느껴질 수 있습니다.",
            "문제를 해결하려고 애쓰기보다, 가끔은 상대방에게 '솔직히 네 의견이 더 나은 것 같아'라고 인정하는 여유가 필요합니다. 이것이 당신의 리더십을 더욱 빛나게 합니다."
        ],
        "forPartnerType_Header": "양자리(PARTNER)가 기억해야 할 조언: 분노를 에너지로",
        "forPartnerType_Tips": [
            "싸움이 길어지기 전에 쿨하게 사과하고 넘어가는 것이 중요하며, 에너지를 함께 발산할 수 있는 스포츠나 모험적인 취미를 가지세요. 분노를 헬스장 샌드백에 풀어야 합니다.",
            "재미있는 논쟁과 '진짜 싸움'을 구분해야 합니다. 상대방의 '가치관'을 건드리는 논쟁은 피해주세요. 이는 회복 불가능한 상처를 남길 수 있습니다.",
            "감정적인 서운함을 쌓아두지 말고, 즉시 '나는 이래서 서운했어'라고 짧고 굵게 표현해야 관계가 안정됩니다. 복잡한 설명은 상대방의 인내심을 시험합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "최고의 기획/영업팀. 아이디어를 내면 즉시 실행하지만, 마무리가 약합니다. 누가 '리더'가 될지 명확히 정하고, 서로의 역할을 존중해야 합니다. 두 명이 같은 일을 하면 반드시 충돌합니다.",
        "onAVacation": "익스트림 스포츠, 즉흥적인 자동차 여행, 번지점프 등 자극적인 여행을 선호합니다. '계획'은 최소화하고 '경험'을 최대로 하는 여행이 이상적이며, 둘 다 게으름을 피우지 않습니다.",
        "asParents": "아이에게 끊임없이 새로운 도전과 경험을 하게 해주는 부모입니다. 하지만 아이의 감성적인 요구를 놓치기 쉬우며, 아이와 '대결'하는 부모가 될 수 있습니다."
    }
}
