{
    "score": 90,
    "title": "태양과 불의 결합, 열정과 자존심의 완벽한 파워 커플",
    "summary": "양자리(Aries)와 사자자리(Leo)는 모두 '불(Fire)'의 별자리입니다. 이들은 태양과 태양이 만난 것처럼, 압도적인 열정, 자신감, 그리고 주도권을 공유하는 **최고의 궁합**입니다.\n\n양자리의 '즉각적인 행동력'과 사자자리의 '웅장한 비전'이 만나면 못 이룰 것이 없는 조합입니다. 둘 다 이기적일 수 있지만, 서로를 진심으로 존경하고 칭찬할 때 관계가 유지됩니다. 누가 더 화려한가에 대한 사소한 경쟁은 끊이지 않을 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "압도적인 에너지와 실행력: 두 유형 모두 에너지가 넘쳐서 연애든 일이든 빠르게 추진합니다. 정체되는 것을 싫어합니다.",
            "서로의 자존심 인정: 양자리의 용기와 사자자리의 위엄을 서로가 진심으로 칭찬하고 지지합니다. 서로의 '리더십'에 도전하기보다 '존경'을 표합니다.",
            "감정을 숨기지 않는 쿨한 관계: 둘 다 솔직하고 단순해서 감정을 묵히지 않습니다. 싸워도 즉시 터뜨리고 화해하는 쿨한 관계 유지가 가능합니다."
        ],
        "weaknesses": [
            "치명적인 '자존심': 두 사람 모두 자존심이 하늘을 찌릅니다. 사소한 논쟁에서도 '먼저 사과하는 것'을 지는 것이라 생각하여 관계가 장기적으로 경직될 수 있습니다.",
            "낭비벽과 충동성: 둘 다 '현재의 만족'을 위해 충동적으로 돈을 쓰기 쉽습니다. 경제 관리에 취약하며, 주변에 이들을 견제해 줄 사람이 필요합니다.",
            "남에게 보여주는 것을 중시: 관계의 '실속'보다 '화려함'을 중시할 수 있습니다. 데이트나 여행에서 '남들의 시선'을 신경 쓰다가 본질적인 행복을 놓칠 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "사자자리는 '긍정의 말(Words of Affirmation)'과 '선물(Gifts)'을 통해 '왕'처럼 대접받길 원합니다. 양자리는 '스킨십(Physical Touch)'과 '행동력'을 원합니다. 서로의 리더십과 매력을 칭찬하는 것이 최고의 사랑 표현입니다.",
        "conflictStyle": "격렬한 '불꽃 싸움'입니다. 소리 지르며 싸울 수 있지만, 뒤끝은 없습니다. 단, 사자자리가 '권위'를 내세우고 양자리가 '자유'를 주장하며 충돌할 경우 갈등이 심화될 수 있습니다.",
        "relationshipGoals": "가장 눈에 띄고, 가장 성공적이며, 가장 모험적인 삶을 사는 것. 단순한 안정보다는 '끊임없이 주목받는 관계'를 목표로 합니다."
    },
    "actionableAdvice": {
        "forMyType_Header": "양자리(MY)가 기억해야 할 조언: 왕을 섬겨라",
        "forMyType_Tips": [
            "상대방(사자자리)의 '자존심'을 건드리는 말은 절대 하지 마세요. 사자자리를 '최고'라고 인정해주면 관계가 편안해집니다.",
            "자신이 리드하고 싶을 때, 강압적으로 하지 말고 '오늘은 당신에게 최고의 데이트를 선물하고 싶어요'라며 '봉사' 형태로 제안하세요. 사자자리는 기꺼이 따를 것입니다.",
            "논쟁 시, 사자자리가 먼저 사과할 때까지 기다리는 인내심이 필요합니다. 먼저 사과하는 것은 사자자리에게 '왕좌를 내주는 것'과 같습니다."
        ],
        "forPartnerType_Header": "사자자리(PARTNER)가 기억해야 할 조언: 상대도 리더다",
        "forPartnerType_Tips": [
            "양자리의 '즉각적인 행동력'을 무시하지 마세요. '철없는 짓'이라 비난하기보다 '그 에너지가 멋지다'고 칭찬해주세요.",
            "공적인 자리에서는 양자리를 치켜세워주고, 사적인 자리에서는 당신이 원하는 것을 명확하게 요청하세요. 양자리는 솔직함을 원합니다.",
            "상대방이 흥분했을 때, '침묵'으로 대응하지 마세요. 양자리는 당신이 화를 내든, 싸우든 솔직한 반응을 원합니다. 당신의 감정을 숨기지 마세요."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "최고의 '경영진' 조합. 사자자리가 '비전'을 제시하고, 양자리가 '공격적인 마케팅'과 '영업'을 담당합니다. 마무리가 약할 수 있지만, 추진력은 최강입니다.",
        "onAVacation": "화려한 명소, 최고급 호텔, 스포츠카 렌트 등 '남들에게 자랑할 만한' 여행을 선호합니다. 사자자리가 계획을 짜고 양자리가 운전을 맡으면 완벽합니다.",
        "asParents": "아이에게 자신감과 독립심을 심어주는 부모입니다. 아이의 능력을 끊임없이 칭찬하며 '넌 최고야'라는 메시지를 심어줍니다."
    }
}
