{
    "score": 85,
    "title": "행동과 이상이 만난 자유로운 혁명가 커플",
    "summary": "양자리(Aries)의 불(Fire)과 물병자리(Aquarius)의 공기(Air)가 만났습니다. 공기가 불을 더 크게 타오르게 하듯, 이들은 서로의 **자유, 개성, 그리고 진보적인 생각**을 존중하며 강력한 시너지를 냅니다.\n\n양자리의 '즉각적인 행동력'과 물병자리의 '독창적인 아이디어'가 결합되어, 이들은 새로운 트렌드를 만들거나 공동의 사회적 목표를 달성하는 데 뛰어난 능력을 보입니다. 단, 너무 개인주의적이어서 서로의 감정적인 깊이를 놓칠 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "서로의 자유와 독립성을 완벽하게 존중합니다. 집착이 없으며 쿨하고 비전통적인 관계를 유지합니다.",
            "독창적인 아이디어와 실행력의 결합: 물병자리가 혁신적인 아이디어를 내면 양자리가 즉시 행동으로 옮겨 현실화합니다.",
            "지적인 자극: 두 유형 모두 지적 호기심이 강해 끊임없이 새로운 지식, 사람, 문화를 탐구하며 대화가 지루할 틈이 없습니다."
        ],
        "weaknesses": [
            "감정적인 거리감: 둘 다 감정 표현을 어려워하고 논리적 해결을 선호하여, 깊은 감정적 교류가 부족해질 수 있습니다.",
            "양자리의 이기심과 물병자리의 차가움: 양자리가 자신의 욕구를 우선시할 때, 물병자리는 감정적으로 거리를 두며 차갑게 대응하여 상대를 지치게 합니다.",
            "충동적인 결정: 둘 다 미래의 안정보다 현재의 흥미와 충동에 따라 움직여, 경제 관리가 취약하거나 무모한 결정을 내리기 쉽습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '함께하는 시간'(새로운 경험)과 '긍정의 말'(지적인 인정)을 선호합니다. 물병자리는 '선물'도 좋아하지만, 그 선물이 '특이하거나' '미래지향적'이어야 합니다.",
        "conflictStyle": "싸움 자체가 매우 '비감정적'이고 논리적입니다. 양자리가 화를 내도 물병자리는 감정에 휘둘리지 않고 '데이터'나 '개념'으로 반박하려 합니다. 이 때문에 양자리는 자신의 분노가 무시당했다고 느껴 더 폭발할 수 있습니다.",
        "relationshipGoals": "평범함을 거부하고, 새로운 사회적 트렌드를 만들거나 세상에 긍정적인 변화를 일으키는 공동의 목표를 추구합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "양자리(MY)가 기억해야 할 조언: 감정을 존중하라",
        "forMyType_Tips": [
            "물병자리의 '독립성'은 절대 침범해서는 안 됩니다. 그들이 혼자만의 시간을 가질 때 간섭하거나 집착하지 마세요.",
            "물병자리의 '아이디어'를 높이 평가하고 공개적으로 칭찬해 주세요. 그들의 지적인 자존심을 만족시켜야 합니다.",
            "싸움 시, '네가 이기나 내가 이기나 해보자'는 태도보다, '우리'의 관계를 개선하려는 의도를 보여야 물병자리가 대화에 응합니다."
        ],
        "forPartnerType_Header": "물병자리(PARTNER)가 기억해야 할 조언: 인간적으로 다가가라",
        "forPartnerType_Tips": [
            "양자리가 감정적으로 흥분했을 때 '논리'나 '데이터'를 들이대지 마세요. 잠시 그들의 감정을 받아주고 '이해한다'는 말 한마디가 더 효과적입니다.",
            "양자리의 충동적인 행동을 '철없는 짓'으로 치부하지 말고, 그들의 '용기'를 인정해 주세요.",
            "가끔은 당신의 비전이나 이상 대신, 양자리의 단순하고 순수한 '현재의 욕구'를 충족시켜 주는 데 집중해야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "물병자리가 '새로운 비즈니스 모델'을 만들면, 양자리가 '최전선에서 영업'을 담당합니다. 성공적인 스타트업의 공동 창업자 조합입니다.",
        "onAVacation": "전통적인 관광지가 아닌, '미지의 행성' 같은 독특하고 비현실적인 장소를 선호합니다. 물병자리가 희귀한 정보를 찾아내고 양자리가 그곳까지의 힘든 여정을 책임집니다.",
        "asParents": "아이에게 '자유로운 사고방식'과 '개성 존중'을 최우선으로 가르치는 부모입니다. 아이의 독립심을 가장 먼저 키워줍니다."
    }
}
