{
    "score": 98,
    "title": "물 원소의 영혼의 결합, 최고의 힐링 커플",
    "summary": "게자리(Cancer)와 물고기자리(Pisces)는 모두 **'물(Water)'** 원소에 속하며, **감정적으로 가장 완벽하게 연결되는 궁합**입니다. 이들은 서로의 복잡하고 미묘한 감정 세계를 완벽하게 이해하고 공감하며, **정서적 안정감과 힐링**을 주고받는 '영혼의 동반자'입니다.\n\n물고기자리의 몽환적인 상상력은 게자리의 가정 생활에 '낭만'을 더해주고, 게자리의 안정적인 보살핌은 물고기자리의 '불안한 영혼'에 안식처를 제공합니다. 갈등이 매우 적으며, 발생하더라도 깊은 공감과 눈물로 쉽게 화해하는, **최고의 궁합**입니다.",
    
    "analysis": {
        "strengths": [
            "최상의 정서적 연결: 서로의 감정을 말하지 않아도 직관적으로 이해하고, 무한한 공감과 위로를 제공합니다.",
            "헌신적인 사랑: 둘 다 헌신적인 사랑과 희생을 기꺼이 감수하며, 상대방의 필요를 자신의 것보다 우선시합니다.",
            "예술적, 창의적 시너지: 물고기자리의 풍부한 상상력과 게자리의 정서적 깊이가 합쳐져 예술이나 낭만적인 영역에서 시너지를 냅니다."
        ],
        "weaknesses": [
            "지나친 감정적 의존: 서로에게 너무 깊이 의존하여 관계가 '폐쇄적'으로 변하고, 외부의 작은 충격에도 두 사람 모두 취약해지기 쉽습니다.",
            "현실 도피: 문제가 생기면 물고기자리는 '몽상'으로, 게자리는 '침묵'으로 도피하여, 현실적인 문제 해결을 소홀히 할 수 있습니다.",
            "감정 기복의 소용돌이: 둘 다 감정 기복이 심해, 함께 우울감에 빠지거나 현실적인 감각을 잃어버릴 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '봉사'(헌신)와 '스킨십'(애착)을 가장 중요하게 생각합니다. 물고기자리는 낭만적인 봉사를, 게자리는 안정적인 보살핌을 선호합니다.",
        "conflictStyle": "감정적인 다툼 후에는 곧바로 후회하고 서로를 위로합니다. 주로 '눈물'과 '공감'을 통해 화해하며, 싸움의 깊은 앙금은 남지 않습니다.",
        "relationshipGoals": "가장 로맨틱하고 헌신적인 '운명적 사랑'을 추구합니다. 서로에게 완벽한 안식처이자 영혼의 동반자가 되기를 바랍니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "게자리(MY)가 기억해야 할 조언: 현실을 붙잡아라",
        "forMyType_Tips": [
            "파트너가 '몽상'이나 '현실 도피'에 빠져있을 때, 탓하기보다 부드럽게 '현실적인 대안'을 제시하며 중심을 잡아주어야 합니다.",
            "당신의 '강한 애착'이 물고기자리의 '희생적인 본능'을 자극하여 관계가 불균형해질 수 있습니다. 서로의 독립적인 시간을 존중해야 합니다.",
            "함께 '재정 계획'이나 '현실적인 집안일'을 정하고 지키는 노력이 필요합니다. 둘 다 무시하면 삶의 기반이 무너집니다."
        ],
        "forPartnerType_Header": "물고기자리(PARTNER)가 기억해야 할 조언: 정서적 안심을 주어라",
        "forPartnerType_Tips": [
            "게자리는 '안정'을 원합니다. 당신의 '변덕스러운 기분'이나 '잦은 희생'으로 그들의 불안감을 자극하지 않아야 합니다.",
            "당신의 '복잡한 감정'을 게자리에게 모두 해소하려 하지 말고, 당신 스스로도 감정을 정화하는 시간을 가져야 합니다.",
            "가끔은 당신의 낭만적인 감성을 이용해 게자리의 '가정적인 노력'에 대해 감동적인 칭찬과 보답을 해주어야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "함께 '예술', '음악', '치유' 관련 분야에서 시너지를 냅니다. 물고기자리가 영감을 제공하고 게자리가 그 영감을 현실적인 형태로 포장합니다.",
        "onAVacation": "가장 낭만적이고 물과 관련된 곳(바닷가, 호수 주변 별장)을 여행합니다. 여행 내내 서로에게 헌신하며 가장 편안한 휴식을 취합니다.",
        "asParents": "아이에게 무한한 애정과 상상력을 제공하는 부모입니다. 아이의 감정과 창의성을 가장 잘 이해하고 지지해 줍니다."
    }
}
