{
    "score": 75,
    "title": "집을 지키는 헌신과 무대를 이끄는 열정, 따뜻한 조화",
    "summary": "게자리(Cancer)의 따뜻하고 정서적인 '물'과 사자자리(Leo)의 화려하고 열정적인 '불'이 만났습니다. 이 관계는 **'보호'와 '찬양'**이라는 상호 보완적인 역할을 바탕으로 따뜻한 조화를 이룹니다.\n\n게자리는 사자자리의 강인한 리더십과 자신감에 안정감을 느끼고 헌신적인 지지를 보냅니다. 사자자리는 게자리의 깊은 애정과 따뜻한 보살핌을 통해 최고의 찬양과 안식처를 얻습니다. 사자자리의 '자존심'이 게자리의 '예민한 감정'을 상하게 할 때 갈등하지만, 서로를 향한 근본적인 애정은 깊습니다.",
    
    "analysis": {
        "strengths": [
            "사자자리의 보호와 게자리의 지지: 사자자리가 게자리를 외부 위험으로부터 보호하고, 게자리는 사자자리의 자존심을 높여주는 헌신적인 지지자가 됩니다.",
            "깊은 애정과 낭만: 사자자리의 드라마틱한 낭만과 게자리의 깊은 감정이 합쳐져, 매우 따뜻하고 감동적인 관계를 유지합니다.",
            "헌신적인 가정 구축: 둘 다 '가족'과 '충성심'을 중요시하여, 안정적이고 사랑이 넘치는 가정을 만드는 데 협력합니다."
        ],
        "weaknesses": [
            "감정 상해: 사자자리의 무심한 행동이나 권위적인 태도가 게자리의 예민한 감정을 깊이 상하게 할 수 있습니다.",
            "관심의 충돌: 사자자리는 외부의 관심을, 게자리는 오직 파트너의 헌신적인 관심을 원하여, 사자자리가 외부 활동에 치중할 때 게자리가 소외감을 느낍니다.",
            "고집과 자존심: 사자자리의 강한 자존심과 게자리의 감정적인 고집이 맞설 때, 화해가 어려울 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "사자자리는 '긍정의 말'과 '선물'(크고 화려한 것)을, 게자리는 '봉사'와 '스킨십'(애착)을 선호합니다. 사자자리는 칭찬을, 게자리는 보살핌을 통해 사랑을 느낍니다.",
        "conflictStyle": "사자자리가 '내가 맞다'며 권위를 주장하면, 게자리는 '서운함'을 느끼고 침묵하며 눈물을 흘립니다. 사자자리는 결국 게자리의 눈물에 자존심을 꺾고 사과하게 됩니다.",
        "relationshipGoals": "사자자리는 '빛나는 커플'로 인정받고 싶어 하고, 게자리는 '가장 안전하고 헌신적인 가족'을 만들고 싶어 합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "게자리(MY)가 기억해야 할 조언: 칭찬을 아끼지 마라",
        "forMyType_Tips": [
            "사자자리는 '찬양'을 먹고 삽니다. 당신의 헌신적인 사랑을 그들의 '리더십'과 '노력'에 대한 구체적인 '긍정의 말'로 자주 표현해야 합니다.",
            "사자자리의 '외부 활동'과 '관심 받으려는 욕구'를 당신에 대한 '사랑 부족'으로 해석하지 마세요. 그것을 존중해야 관계가 유지됩니다.",
            "때로는 당신이 먼저 사자자리를 위한 '로맨틱하고 극적인' 이벤트를 계획하여 그들의 자존심을 세워주어야 합니다."
        ],
        "forPartnerType_Header": "사자자리(PARTNER)가 기억해야 할 조언: 섬세함을 보여주어라",
        "forPartnerType_Tips": [
            "게자리는 '무심한 말'에 깊이 상처받습니다. 당신의 강인한 태도를 가끔 내려놓고, 그들의 감정에 대해 '섬세하게' 물어봐 주어야 합니다.",
            "당신의 '무대'만큼이나 게자리의 '보금자리'를 중요하게 생각해야 합니다. 집안일이나 가족 문제에 헌신적으로 참여하는 모습을 보여야 합니다.",
            "게자리가 원하는 '안정적인 스킨십'과 '애착'을 충분히 제공해야 합니다. 이는 그들의 불안감을 해소하는 유일한 길입니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "사자자리가 '프로젝트 리더'를 맡아 비전을 제시하면, 게자리는 '팀 케어'나 '정서적 지원'을 맡아 팀원들의 사기를 높입니다. 성공 가능성이 높습니다.",
        "onAVacation": "사자자리가 최고급 '5성급 호텔'을 예약하고, 게자리가 '가정식' 레스토랑을 찾아내 편안하고 럭셔리한 휴가를 즐깁니다.",
        "asParents": "사자자리는 아이에게 '자신감'과 '리더십'을, 게자리는 '무한한 애정'과 '정서적 안정'을 가르칩니다. 아이를 가장 자랑스러워하는 부모입니다."
    }
}
