{
    "score": 99,
    "title": "물 원소의 영혼의 결합, 가장 강렬하고 깊은 사랑의 궁합",
    "summary": "게자리(Cancer)와 전갈자리(Scorpio)는 모두 **'물(Water)'** 원소에 속하며, **감정적으로 가장 완벽하게 연결되는 궁합**입니다. 이들은 서로의 복잡하고 미묘한 감정 세계를 완벽하게 이해하고 공감하며, **정서적 안정감과 헌신**을 주고받는 '영혼의 동반자'입니다.\n\n전갈자리의 강렬한 열정은 게자리의 정서적 깊이를 자극하고, 게자리의 안정적인 보살핌은 전갈자리의 '불안한 집착'을 포근하게 감싸 안습니다. 둘 다 강한 애착과 소유욕을 가지지만, 그 애착의 방향이 서로를 향해 있어 **황도 12궁 내 최고의 궁합**으로 꼽힙니다.",
    
    "analysis": {
        "strengths": [
            "최상의 정서적 연결: 서로의 감정을 말하지 않아도 직관적으로 이해하고, 무한한 공감과 위로를 제공합니다.",
            "강력한 충성심과 애착: 둘 다 강한 애착과 소유욕을 가지며, 이 힘이 서로에게 향해 있어 절대적인 신뢰와 헌신적인 사랑을 나눕니다.",
            "깊은 친밀감: 둘 다 감정을 깊게 느끼고 표현하는 별자리라, 친밀한 관계에서 매우 강렬하고 만족스러운 연결감을 느낍니다."
        ],
        "weaknesses": [
            "과도한 의존과 질투: 서로에게 너무 깊이 의존하여 관계가 '폐쇄적'으로 변하고, 외부의 작은 자극에도 두 사람 모두 질투심과 불안감을 느낄 수 있습니다.",
            "감정 기복의 소용돌이: 둘 다 감정 기복이 심해, 함께 깊은 우울감이나 감정적인 소용돌이에 빠지기 쉽습니다.",
            "현실 도피 위험: 둘 다 갈등이나 어려운 현실 문제를 회피하려 합니다. 전갈자리는 침묵하고, 게자리는 도피하여 문제가 해결되지 않고 쌓여 관계를 해칠 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '봉사'(헌신)와 '스킨십'(깊은 애착)을 가장 중요하게 생각합니다. 전갈자리의 강렬한 사랑을 게자리가 안정적으로 보살피는 형태입니다.",
        "conflictStyle": "둘 다 갈등을 싫어하지만, 감정이 격해지면 '누가 더 상처받았는지'를 두고 싸웁니다. 하지만 전갈자리의 통찰력으로 문제를 깊이 파고들어, 진정한 해결에 도달할 수 있습니다.",
        "relationshipGoals": "서로에게 완벽한 안식처이자 영혼의 동반자가 되는 것. 외부와 단절된 '완전한 둘만의 세상'을 구축하는 것을 목표로 합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "게자리(MY)가 기억해야 할 조언: 신뢰를 보여줘라",
        "forMyType_Tips": [
            "전갈자리의 '미스터리함'을 의심하지 마세요. 그들의 비밀스러운 모습은 당신을 사랑하지 않아서가 아니라, 그들의 '본질'입니다.",
            "전갈자리의 강렬한 '통제 욕구'를 당신에 대한 '깊은 사랑'의 표현으로 해석하고, 그들의 집착을 이해하려 노력해야 합니다.",
            "가끔은 당신이 먼저 전갈자리의 '열정적인 계획'에 동참하여, 그들의 에너지를 현실화시키는 데 도움을 주어야 합니다."
        ],
        "forPartnerType_Header": "전갈자리(PARTNER)가 기억해야 할 조언: 부드러운 사랑",
        "forPartnerType_Tips": [
            "게자리의 '예민한 감정'을 비웃거나 무시하지 마세요. 당신의 강력한 에너지가 그들의 여린 감정을 쉽게 부술 수 있습니다. 부드럽게 대해야 합니다.",
            "당신의 '강렬한 열정'을 '침묵'이나 '복수' 대신 '따뜻한 말'과 '헌신적인 행동'으로 표현해야 게자리가 안심합니다.",
            "게자리가 원하는 '안정적인 일상'을 존중하고, 당신의 삶에 그들의 '가정적인 노력'을 반영해야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "전갈자리가 '비밀스러운 조사'나 '재정'을 맡고, 게자리가 '팀원 케어'나 '정서적 지원'을 맡습니다. 서로의 영역을 완벽하게 신뢰해야 성공합니다.",
        "onAVacation": "사람들의 시선이 닿지 않는 '은밀한 곳'으로 떠나는 여행을 선호합니다. 다이빙, 스파, 미식 투어 등 '깊은 감각적 만족'을 주는 활동을 함께합니다.",
        "asParents": "아이에게 '강한 의지'와 '진실'(전갈자리)을, 그리고 '무한한 애정'과 '보살핌'(게자리)을 가르칩니다. 아이의 감정과 정신력 모두를 키워줍니다."
    }
}
