{
    "score": 95,
    "title": "불꽃의 대향연, 함께 세상을 탐험하는 활력 넘치는 커플",
    "summary": "사자자리(Leo)와 사수자리(Sagittarius)는 둘 다 **'불(Fire)'** 원소에 속하며, **최고의 열정, 긍정, 그리고 모험심**을 공유하는 **가장 활력 넘치는 궁합** 중 하나입니다.\n\n사수자리의 낙천적이고 자유로운 에너지는 사자자리의 드라마틱한 낭만에 완벽하게 부응합니다. 사자자리는 사수자리의 끝없는 모험에 '용기'와 '자신감'을 더해줍니다. 이들은 함께 세상을 탐험하고 배우며, **지루함이라는 것을 모르는 커플**입니다. 서로의 **자유와 자존심**을 존중하는 한, 관계는 폭발적인 시너지를 냅니다.",
    
    "analysis": {
        "strengths": [
            "최고의 열정과 시너지: 둘 다 긍정적이고 활동적이며, 관계에 대한 열정이 끊임없이 타오릅니다.",
            "자유와 존중: 사수자리는 사자자리의 자존심을 높여주고, 사자자리는 사수자리의 독립심을 인정합니다.",
            "공동의 모험심: 함께 여행하고, 배우고, 새로운 것에 도전하는 것을 좋아합니다. 삶 자체가 신나는 '놀이'가 됩니다."
        ],
        "weaknesses": [
            "사수자리의 무심함: 사수자리의 지나친 솔직함이나 무심한 행동이 사자자리의 예민한 자존심을 상하게 할 수 있습니다.",
            "지나친 낭비벽: 둘 다 순간의 즐거움을 위해 돈을 아끼지 않아 재정 관리가 불안정해지기 쉽습니다.",
            "현실적인 문제 회피: 관계가 너무 재미있고 활력 넘치는 것에만 치중하여, 현실적인 책임이나 심각한 문제를 미루기 쉽습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '긍정의 말'과 '함께하는 시간'(모험)을 가장 중요시합니다. 서로를 칭찬하고 함께 새로운 곳을 탐험할 때 사랑을 느낍니다.",
        "conflictStyle": "사수자리가 '진실'을 바탕으로 논쟁하면, 사자자리가 '권위'와 '분노'로 대응합니다. 하지만 둘 다 앙금이 오래 남지 않고, 쿨하게 화해하고 다음 모험을 계획합니다.",
        "relationshipGoals": "세상을 함께 누비고, 끊임없이 성장하며, 주변 사람들에게 행복한 에너지를 전파하는 '이상적인 커플'이 되는 것을 목표로 합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "사자자리(MY)가 기억해야 할 조언: 자유를 허용하라",
        "forMyType_Tips": [
            "사수자리의 '잦은 외출'이나 '모험'을 당신에 대한 '무관심'으로 오해하지 마세요. 그들의 타고난 독립심을 인정해야 합니다.",
            "사수자리는 '솔직함'을 중시합니다. 그들의 지나친 솔직함이 당신의 자존심을 건드려도 '나를 해치려는 의도가 아니다'라고 이해해야 합니다.",
            "가끔은 당신의 주도권을 내려놓고, 사수자리가 이끄는 '무계획적인 모험'에 몸을 맡기는 노력이 필요합니다."
        ],
        "forPartnerType_Header": "사수자리(PARTNER)가 기억해야 할 조언: 칭찬을 아끼지 마라",
        "forPartnerType_Tips": [
            "사자자리는 '칭찬'을 먹고 삽니다. 그들의 작은 노력에도 '당신이 최고야'라는 긍정의 말을 아낌없이 해 주어야 합니다.",
            "당신의 '모험적인 계획'에 사자자리를 '주인공'으로 초대하세요. 그들의 자존심을 세워주는 것이 가장 중요합니다.",
            "함께 '재정 계획'을 세우고 지키려 노력해야 합니다. 둘 다 충동적인 소비를 하는 경향이 있음을 인지해야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "사자자리가 '팀 리더'를, 사수자리가 '아이디어 발굴'이나 '해외 영업'을 맡습니다. 함께 큰 비전을 실현하는 데 최적화되어 있습니다.",
        "onAVacation": "가장 새롭고, 멀고, 문화적으로 흥미로운 곳을 여행합니다. 여행 중 끊임없이 웃고 즐기며, 현지인들과의 교류를 주도합니다.",
        "asParents": "아이에게 '세상에 대한 긍정'과 '용기'를 심어주는 부모입니다. 아이를 자유롭고 자신감 있게 키웁니다."
    }
}
