{
    "score": 70,
    "title": "두 태양의 충돌, 강렬한 열정과 자존심 싸움",
    "summary": "사자자리(Leo)와 사자자리가 만났습니다. 둘 다 **태양(Sun)의 지배**를 받는 **불(Fire)** 원소로, 이 관계는 **강렬한 열정과 낭만**으로 가득 차 있습니다. 서로의 드라마틱한 매력에 깊이 빠져들며, 외부에서 볼 때 가장 **화려하고 주목받는 커플**이 됩니다.\n\n하지만 둘 다 **강한 자존심과 리더십 욕구**를 가지고 있어, 끊임없이 주도권을 놓고 싸우게 됩니다. 서로에게 **무한한 칭찬과 관심**이 끊이지 않으면 최고의 관계를 유지하지만, 한 쪽이라도 무시당한다고 느끼면 관계가 불꽃 싸움으로 번질 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "최고의 열정과 낭만: 드라마틱하고 화려한 연애를 합니다. 상대방을 위해 아낌없이 투자하고 헌신합니다.",
            "넘치는 활력과 자신감: 함께 있을 때 세상의 중심이 된 듯한 자신감을 얻습니다. 모든 활동에 활력이 넘칩니다.",
            "충성심: 둘 다 관계에 대한 충성심과 의리가 강하여, 외부의 위협으로부터 서로를 지키려 합니다."
        ],
        "weaknesses": [
            "자존심의 전쟁: 둘 다 굽히지 않는 자존심 때문에 사소한 갈등도 쉽게 해결되지 않고 큰 싸움으로 번집니다.",
            "지나친 관심 욕구: 서로에게 '주목'을 받고 싶어하여, 한 쪽이 다른 일에 집중하면 다른 쪽이 질투와 소외감을 느낍니다.",
            "지출 문제: 둘 다 화려하고 값비싼 것을 좋아하며 관대한 성향 때문에, 재정 관리가 어려워질 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '긍정의 말'과 '선물'(크고 화려한 것)을 가장 중요시합니다. 칭찬과 찬양이 끊임없이 오가야 사랑을 느낍니다.",
        "conflictStyle": "둘 다 목소리를 높이고 드라마틱하게 싸웁니다. 하지만 싸움 후에는 상대방의 자존심을 세워주는 '화려한 사과'나 '선물'로 빠르게 화해합니다.",
        "relationshipGoals": "주변 사람들로부터 '가장 멋진 커플'로 인정받고, 화려하고 풍요로운 삶을 함께 누리는 것을 목표로 합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "사자자리(MY)가 기억해야 할 조언: 무대를 나눠라",
        "forMyType_Tips": [
            "관계의 '주도권'을 독점하려 하지 말고, 파트너에게도 빛날 수 있는 '무대'를 기꺼이 양보하고 칭찬해야 합니다.",
            "파트너의 '사소한 노력'에도 구체적인 '칭찬의 말'을 아끼지 마세요. 그들의 인정 욕구를 충족시켜 주어야 합니다.",
            "함께 '공동의 목표'(예: 집 꾸미기, 재능 기부)를 설정하여, 개인의 관심 대신 '우리'의 명예를 높이는 데 집중해야 합니다."
        ],
        "forPartnerType_Header": "사자자리(PARTNER)가 기억해야 할 조언: 작은 것에 감사하라",
        "forPartnerType_Tips": [
            "상대방이 당신에게 바치는 '작은 헌신'도 '당연하다'고 여기지 말고, 진심으로 감사함을 표현해야 합니다.",
            "파트너의 '지출'이나 '낭만적인 계획'을 비난하지 말고, 함께 예산을 세워 '현실적인 범위 내의 사치'를 즐기도록 유도해야 합니다.",
            "가끔은 둘만의 조용한 시간을 통해 '감정적인 깊이'를 나누는 노력이 필요합니다. 화려함만이 전부는 아닙니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "함께 '이벤트 기획'이나 '홍보 마케팅' 등 화려하고 사람들의 이목이 집중되는 분야에서 일하면 성공합니다. 둘 다 뛰어난 리더입니다.",
        "onAVacation": "가장 럭셔리하고 웅장한 곳, 사람들이 많이 모이는 휴양지나 파티를 선호합니다. 여행지에서 주변의 시선을 즐깁니다.",
        "asParents": "아이에게 '자신감'과 '웅장한 꿈'을 심어주는 부모입니다. 아이의 능력을 세상에 자랑하고 싶어 합니다."
    }
}
