{
    "score": 90,
    "title": "물 원소의 영혼의 거울, 깊은 공감으로 맺어진 운명적 사랑",
    "summary": "두 물고기자리(Pisces)가 만났습니다. 이들은 **두 명의 '물(Water)' 원소**와 **두 명의 해왕성(Neptune) 지배**가 결합하여 **황도 12궁에서 가장 로맨틱하고 공감 능력이 뛰어난 관계**를 만듭니다. 이들은 **무한한 이해심, 창의성, 그리고 영적인 헌신**이라는 가치를 공유합니다.\n\n서로에게 **영혼의 거울**이 되어주며, 말하지 않아도 모든 감정을 이해합니다. 이 관계는 현실 세계를 초월한 아름다운 환상과 같지만, **현실 감각과 현실적인 경계**가 부족하여 함께 현실에 발을 딛지 못할 경우 심각한 문제가 발생할 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "최고의 공감 능력: 서로의 감정 기복과 깊은 감성을 완벽하게 이해하고 받아들이며, 최고의 정서적 위로를 제공합니다.",
            "무한한 로맨티시즘: 헌신적이고 희생적인 사랑을 추구하며, 관계를 아름다운 꿈처럼 만들어줍니다.",
            "예술적/영적 시너지: 둘 다 예술적 감수성과 상상력이 뛰어나, 함께 창의적인 활동이나 영적인 탐구를 할 때 최고의 시너지를 냅니다."
        ],
        "weaknesses": [
            "현실 감각 최악: 둘 다 재정, 시간 관리, 일상적인 책임 등 현실적인 문제에 완전히 무관심하거나 회피하려 합니다.",
            "경계 부족 및 의존성: 서로에게 너무 깊이 의존하고 감정의 경계가 모호해져, 관계가 외부 세계와 단절되거나 건강하지 못한 방식으로 흐를 수 있습니다.",
            "도피와 희생: 문제가 생기면 솔직한 대화 대신 '환상 속으로 도피'하거나, 지나치게 '희생'만 하여 문제가 해결되지 않습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "둘 다 '스킨십'과 '헌신'(희생적인 봉사)을 가장 선호합니다. '따뜻한 위로'와 '영적인 교감'이 중요합니다.",
        "conflictStyle": "싸움은 격렬하기보다 '감정적인 눈물'과 '침묵'으로 흐릅니다. 서로의 감정을 너무 잘 알아서 비난하기보다 스스로 고통을 감수하려 합니다. 솔직한 대화 대신 감정적인 치유로 해결하려 합니다.",
        "relationshipGoals": "외부 세계의 고통으로부터 보호되는 '두 사람만의 성역'을 만들고, 영적이고 예술적인 삶을 사는 것입니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "물고기자리(MY)가 기억해야 할 조언: 현실을 응시하라",
        "forMyType_Tips": [
            "파트너의 '감정 기복'을 모두 당신의 몫으로 짊어지려 하지 마세요. '건강한 경계'를 설정하는 노력이 필요합니다.",
            "함께 '재정적인 규칙'이나 '생활 습관'에 대한 구체적인 계획을 세우고, 반드시 지키려 노력해야 합니다.",
            "문제가 발생했을 때 '도피' 대신 '솔직한 감정'을 표현해야 합니다. 침묵은 오해를 키울 수 있습니다."
        ],
        "forPartnerType_Header": "물고기자리(PARTNER)가 기억해야 할 조언: 발을 땅에 디뎌라",
        "forPartnerType_Tips": [
            "파트너의 '희생'을 당연하게 여기지 말고, 그들의 노력에 대해 구체적인 '감사'를 표현해야 합니다.",
            "서로의 '예민한 감수성'을 존중하되, 감정적인 문제 해결을 위해 논리적이고 객관적인 '제3의 인물'의 조언을 구하는 것도 고려해야 합니다.",
            "당신의 '무한한 상상력'을 '예술이나 창작 활동'을 통해 현실 세계에 풀어낼 수 있도록 노력해야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "함께 '예술 치료', '영화 제작', '사진 작가' 등 창의성과 감성이 필요한 분야에서 일할 때 시너지를 냅니다. 하지만 '비즈니스 관리'는 외부 전문가에게 맡겨야 합니다.",
        "onAVacation": "고요하고 아름다운 휴양지, 바닷가, 명상 센터 등 '영적인 휴식'을 취할 수 있는 곳을 선호합니다. 여행 일정은 매우 유연합니다.",
        "asParents": "아이에게 '무한한 사랑'과 '공감 능력'을 가르치는 부모입니다. 아이의 감성을 매우 잘 이해하지만, 규율은 거의 주지 않습니다."
    }
}
