{
    "score": 80,
    "title": "안정적인 땅과 빛나는 불, 럭셔리 라이프를 추구하는 왕족 커플",
    "summary": "황소자리(Taurus)의 느리고 안정적인 '땅'과 사자자리(Leo)의 화려하고 빛나는 '불'이 만났습니다. 이 둘은 모두 **'고급스러움', '편안함', 그리고 '충성심'**을 중시하는 **고정궁(Fixed Sign)**입니다. 관계가 한 번 정립되면 변동성이 거의 없으며, 함께 럭셔리하고 안정적인 삶을 구축합니다.\n\n사자자리는 황소자리에게 '자신감'과 '즐거움'을 주고, 황소자리는 사자자리의 '야망'에 '현실적인 재정 기반'을 제공합니다. 다만, 둘 다 **극도의 고집**과 **강한 자존심**을 가지고 있어, 사소한 논쟁이 '권력 싸움'으로 번지기 쉽습니다.",
    
    "analysis": {
        "strengths": [
            "강력한 충성심: 둘 다 관계에 대한 헌신과 충성심이 강하며, 상대를 자랑스럽게 여겨 공개적으로 애정을 표현합니다.",
            "물질적 풍요: 사자자리가 지향하는 '화려함'과 황소자리의 '금전 관리 능력'이 합쳐져 풍요로운 라이프스타일을 구현합니다.",
            "감각적인 조화: 사자자리의 열정적인 애정 표현과 황소자리의 깊은 감각이 만나 육체적인 끌림이 매우 강합니다."
        ],
        "weaknesses": [
            "타협 불가능한 고집: '고정궁 대 고정궁'의 싸움입니다. 둘 다 자신의 의견이 절대적으로 옳다고 생각하여, 한번 싸움이 나면 끝까지 물러서지 않고 상대를 굴복시키려 합니다.",
            "지나친 사치: 둘 다 돈을 쓰는 것에 관대하여, 사자자리의 과시욕과 황소자리의 고급품 선호가 합쳐져 재정적으로 위험할 수 있습니다.",
            "자존심의 충돌: 사자자리는 '인정'을 원하고 황소자리는 '정당성'을 원합니다. 서로에게 칭찬과 인정을 갈구하며 에너지 소모가 큽니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "사자자리는 '긍정의 말'(칭찬)과 '선물'을, 황소자리는 '스킨십'과 '봉사'를 원합니다. 황소자리가 사자자리를 공개적으로 자랑스럽게 여겨야 관계가 원만합니다.",
        "conflictStyle": "권력 다툼입니다. 사자자리가 소리를 지르거나 극적인 행동을 취하면, 황소자리는 미동 없이 침묵하며 고집을 부립니다. 누가 더 오래 버티는지의 싸움이며, 화해하는 데 오랜 시간이 걸립니다.",
        "relationshipGoals": "사회적으로 성공하고, 아름답고 편안한 집을 꾸미며, 주변의 부러움을 사는 '완벽한 커플'이 되는 것을 목표로 합니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "황소자리(MY)가 기억해야 할 조언: 칭찬하고 인정하라",
        "forMyType_Tips": [
            "사자자리의 '자존심'이 꺾이는 상황을 만들지 마세요. 그들의 노력과 성과에 대해 진심 어린 칭찬을 자주 건네야 합니다.",
            "논쟁에서 이기려 하지 말고, '너의 의견도 옳아'라고 인정해 준 후, 당신의 합리적인 대안을 제시하는 방식으로 대화하세요.",
            "가끔은 당신의 재정 감각을 내려놓고, 사자자리가 주도하는 '화려하고 즉흥적인' 이벤트에 참여해야 관계에 활력이 생깁니다."
        ],
        "forPartnerType_Header": "사자자리(PARTNER)가 기억해야 할 조언: 고집을 꺾어라",
        "forPartnerType_Tips": [
            "황소자리의 '느린 템포'를 무시하지 말고 존중해야 합니다. 황소자리는 신중하며, 그들의 신중함이 당신의 실수를 막아줍니다.",
            "재정 문제에서 '지출'만 담당하지 말고, 황소자리의 재정 계획에 적극적으로 협력하는 모습을 보여주어야 합니다.",
            "논쟁 시, 당신의 권위를 주장하기보다 '황소자리의 편안함'을 먼저 고려하는 배려를 보여주세요."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "사자자리는 'CEO'나 '대표' 역할을 맡아 비전을 제시하고 팀을 이끌어야 하며, 황소자리는 'CFO'나 '운영 이사'를 맡아 그 비전의 재정적 기반을 튼튼하게 다져야 합니다.",
        "onAVacation": "최고급 호텔, 미슐랭 레스토랑, 유명한 미술관 등 '최고'의 경험만을 추구합니다. 사자자리가 계획을 세우고 황소자리가 비용을 관리합니다.",
        "asParents": "아이에게 자신감과 리더십(사자자리)을, 그리고 끈기와 물질적 안정(황소자리)을 가르칩니다. 아이의 겉모습과 내실 모두를 신경 쓰는 부모입니다."
    }
}
