{
    "score": 95,
    "title": "땅과 물의 완벽한 조화, 세상에서 가장 포근한 힐링 커플",
    "summary": "황소자리(Taurus)의 느리고 안정적인 '땅'과 게자리(Cancer)의 깊고 보호적인 '물'이 만났습니다. 이 관계는 **강력한 정서적 유대감**과 **물질적인 안정**을 동시에 갖춘 **최고의 궁합**입니다.\n\n둘 다 '가정', '안정', '음식'을 중요시하며, 게자리가 제공하는 정서적 지지와 황소자리가 제공하는 현실적인 기반이 서로에게 완벽한 안식처가 됩니다. 싸움이 거의 없고, 누가 먼저랄 것 없이 서로에게 헌신하는 관계입니다.",
    
    "analysis": {
        "strengths": [
            "최고의 안정감: 둘 다 변화를 싫어하고 가정을 중시하여, 매우 안정적이고 신뢰할 수 있는 관계를 유지합니다.",
            "깊은 정서적 연결: F(감정)형이라 서로의 감정을 깊이 이해하고 보호하려 합니다. 말없이도 통하는 교감이 있습니다.",
            "물질적 풍요와 감각적 만족: 황소자리의 금전 관리 능력과 게자리의 훌륭한 요리 솜씨가 결합되어, '맛있는 음식과 편안한 집'이라는 최고의 행복을 추구합니다."
        ],
        "weaknesses": [
            "지나친 정체: 둘 다 변화를 극도로 싫어하고 과거에 얽매여 관계가 쉽게 지루해지고 정체될 위험이 있습니다. 새로운 자극을 외부에서 찾아야 합니다.",
            "소유욕과 집착: 게자리의 보호 본능과 황소자리의 소유욕이 합쳐져, 서로를 밖으로 나가지 못하게 '통제'하려 들 수 있습니다.",
            "갈등 묵히기: 둘 다 싸움을 싫어하고 서운함을 마음에 담아둡니다. 문제가 해결되지 않고 곪아 터질 때까지 침묵할 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "게자리는 '봉사(Acts of Service)'와 '함께하는 시간'(요리, 집 데이트)을, 황소자리는 '선물'과 '스킨십'(편안한 포옹)을 선호합니다. 서로가 원하는 사랑의 언어가 명확합니다.",
        "conflictStyle": "주로 '침묵 대 침묵'의 형태입니다. 누가 먼저랄 것 없이 상처받고 입을 닫습니다. 싸움 후에는 맛있는 음식을 함께 나누거나 편안한 스킨십을 통해 자연스럽게 화해합니다.",
        "relationshipGoals": "'따뜻한 가정'과 '현실적인 안정'이 최우선 목표입니다. 돈 걱정 없이 서로를 챙기며 사는 것이 이 커플의 궁극적인 비전입니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "황소자리(MY)가 기억해야 할 조언: 안심시켜라",
        "forMyType_Tips": [
            "게자리의 기분 변화를 '변덕'으로 치부하지 마세요. 그들의 감정은 사실이며, 그 감정을 인정해 주는 것이 중요합니다.",
            "게자리가 불안해하지 않도록, 친구들과의 모임이나 외부 활동 후에는 반드시 '내가 돌아왔다'는 안심을 전해주세요.",
            "황소자리의 고집을 잠시 내려놓고, 게자리가 원하는 감정적인 대화에 응해주세요."
        ],
        "forPartnerType_Header": "게자리(PARTNER)가 기억해야 할 조언: 껍데기를 깨라",
        "forPartnerType_Tips": [
            "서운한 감정이 생겼을 때, 억지로 참거나 침묵하지 말고 '솔직히 지금 기분이 좋지 않다'고 짧게라도 표현하는 훈련을 해야 합니다.",
            "상대방의 '안정적인 템포'를 믿고 따르세요. 황소자리는 당신을 배신하지 않습니다. 질투나 소유욕을 조절해야 합니다.",
            "가끔은 집 밖으로 나가 새로운 자극(예: 야외 콘서트, 새로운 맛집 탐험)을 시도하여 관계에 활력을 불어넣어야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "게자리는 팀의 정서적 안정과 서포트 역할을, 황소자리는 '프로젝트의 재정 관리'와 '현실적인 일정'을 담당합니다. 서로의 헌신을 바탕으로 튼튼한 팀워크를 보입니다.",
        "onAVacation": "여행의 목적은 '힐링'과 '미식'입니다. 5성급 리조트, 최고의 음식, 그리고 편안한 환경을 선호합니다. 힘든 액티비티는 피하고, 좋은 숙소에서 오래 머무르는 것을 좋아합니다.",
        "asParents": "아이에게 물질적 안정과 헌신적인 사랑을 제공하는 부모입니다. 아이의 정서적 안정과 교육에 최선을 다하지만, 변화에 대한 적응을 돕는 데는 어려움을 느낄 수 있습니다."
    }
}
