{
    "score": 65,
    "title": "아름다움과 편안함의 공동 추구, 그러나 행동력과 우유부단의 충돌",
    "summary": "황소자리(Taurus)의 느리고 안정적인 '땅'과 천칭자리(Libra)의 우아하고 조화로운 '공기'가 만났습니다. 이 둘은 금성(Venus)의 지배를 받아 **'아름다움', '예술', '조화', '쾌적한 환경'**을 공동의 가치로 삼습니다.\n\n하지만 황소자리가 **'굳건한 현실'**과 **'고집스러운 안정'**을 추구하는 반면, 천칭자리는 **'가벼운 소통'**과 **'갈등 회피'**에 집중합니다. 황소자리는 천칭자리의 끝없는 우유부단함에 답답함을 느끼고, 천칭자리는 황소자리의 변화 없는 일상에 지루함을 느낄 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "심미적 공감대: 둘 다 예술, 패션, 인테리어 등 아름다움을 추구하는 감각이 뛰어나, 집안과 데이트 환경을 쾌적하고 아름답게 꾸밉니다.",
            "조화로운 관계: 천칭자리가 갈등을 피하고 황소자리가 안정적인 템포를 유지하여, 표면적으로는 매우 평화롭고 우아한 관계를 유지합니다.",
            "금전적 안정성: 황소자리의 금전 감각과 천칭자리의 사회적인 세련됨이 합쳐져, 품위 있는 생활 수준을 유지합니다."
        ],
        "weaknesses": [
            "느린 속도의 차이: 황소자리는 결정을 내리는 데 오래 걸리고, 천칭자리는 우유부단하여 아예 결정을 내리지 못합니다. 이 느림이 답답함으로 발전할 수 있습니다.",
            "갈등 회피: 천칭자리는 불편한 대화를 극도로 회피하고, 황소자리는 문제를 묵혀둡니다. 근본적인 문제가 해결되지 않고 쌓여 결국 관계의 기반을 해칠 수 있습니다.",
            "황소자리의 고집: 황소자리가 한번 고집을 부리면, 천칭자리는 '평화'를 위해 논쟁을 포기하고 속으로 삭이는 경향이 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "천칭자리는 '긍정의 말'과 '함께하는 시간'(우아한 데이트)을, 황소자리는 '선물'과 '스킨십'(편안한 포옹)을 선호합니다. 천칭자리는 황소자리의 느린 애정 표현에 종종 외로움을 느낄 수 있습니다.",
        "conflictStyle": "천칭자리가 '화해의 제스처'를 취하려 하지만, 황소자리는 묵묵히 버티며 응답이 느립니다. 결국 천칭자리는 황소자리의 고집에 지쳐 자신의 의견을 포기하는 경우가 많습니다.",
        "relationshipGoals": "조화롭고 아름다운 가정과, 사교 생활을 함께 즐길 수 있는 안정적인 환경을 만드는 것이 목표입니다. '싸움이 없는' 관계 자체를 이상으로 봅니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "황소자리(MY)가 기억해야 할 조언: 행동으로 보여줘라",
        "forMyType_Tips": [
            "천칭자리의 '우유부단함'을 비난하지 마세요. 대신 '네가 고른 A와 B 중, A를 선택하자'처럼 최종 결정을 황소자리가 빠르게 내려줘야 합니다.",
            "불편한 감정이 있다면, 침묵 대신 '천칭아, 지금 우리가 이 문제를 이야기해야 할 것 같아'라고 말하며 대화를 유도해야 합니다.",
            "천칭자리의 '사교 활동'을 존중하고 함께 참여해야 합니다. 그들의 외향적인 에너지를 막지 마세요."
        ],
        "forPartnerType_Header": "천칭자리(PARTNER)가 기억해야 할 조언: 현실을 직시하라",
        "forPartnerType_Tips": [
            "관계에서 '갈등 회피'가 능사가 아님을 인정해야 합니다. 황소자리와 정면으로 마주 앉아 문제를 해결하려는 노력이 필요합니다.",
            "결정을 내릴 때 너무 많은 옵션을 고려하지 마세요. 황소자리는 당신의 '빠르고 단호한 선택'에 신뢰를 느낍니다.",
            "황소자리의 '편안함'을 침범하는 '과도한 사교 활동'은 자제해야 합니다. 황소자리는 당신과의 '오붓한 시간'을 원합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "천칭자리는 '외부 홍보'나 '디자인'처럼 미적인 부분을, 황소자리는 '예산 집행'과 '프로젝트 관리'를 맡습니다. 천칭자리의 우아함과 황소자리의 실용성이 결합됩니다.",
        "onAVacation": "천칭자리가 '아름다운 여행지'를 선정하면, 황소자리가 '최고의 호텔'을 예약합니다. 예술과 미식을 즐기는 우아한 여행을 선호합니다.",
        "asParents": "아이에게 미적 감각과 사회성(천칭자리)을, 그리고 경제적 안정과 끈기(황소자리)를 가르치는 부모입니다. 아이의 선택을 둘 다 존중하려 하지만, 결정은 느립니다."
    }
}
