{
    "score": 90,
    "title": "땅과 물의 완벽한 융합, 감성적인 안식처 커플",
    "summary": "황소자리(Taurus)의 느리고 안정적인 '땅'과 물고기자리(Pisces)의 깊고 감성적인 '물'이 만났습니다. 이 관계는 **강력한 정서적 지지**와 **물질적인 안정**을 동시에 갖춘 **최고의 궁합**입니다.\n\n물고기자리는 황소자리의 안정감 속에서 불안함을 덜고, 황소자리는 물고기자리의 깊은 감성과 예술적 영감을 통해 삶의 풍요를 더합니다. 서로가 서로에게 '완벽한 안식처'가 되어주는 조합입니다. 감정적인 드라마가 없고, 조용하고 편안한 사랑을 나눕니다.",
    
    "analysis": {
        "strengths": [
            "최고의 안정감과 정서적 지지: 황소자리의 현실적인 기반과 물고기자리의 무한한 공감이 결합되어, 서로에게 가장 안전한 피난처를 제공합니다.",
            "감각적인 조화: 둘 다 오감을 통한 만족을 중시합니다. 맛있는 음식, 편안한 음악, 아름다운 환경 등 '힐링'을 함께 추구합니다.",
            "물고기자리의 직관력: 황소자리가 놓치기 쉬운 '직관적인 위험'이나 '감정적인 흐름'을 물고기자리가 미리 감지하여 알려줄 수 있습니다."
        ],
        "weaknesses": [
            "현실 도피 위험: 둘 다 갈등이나 어려운 현실 문제를 회피하려 합니다. 황소자리는 침묵하고, 물고기자리는 도피하여 문제가 해결되지 않고 쌓여 관계를 해칠 수 있습니다.",
            "황소자리의 고집: 황소자리가 한번 고집을 부리면, 물고기자리는 그 고집을 꺾지 못하고 '희생'을 선택합니다. 이 희생이 누적되어 물고기자리가 지칠 수 있습니다.",
            "지나친 정체: 둘 다 변화를 극도로 싫어하고 느린 템포를 유지하여, 관계가 쉽게 지루해지고 매너리즘에 빠지기 쉽습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "물고기자리는 '함께하는 시간'과 '봉사'를 원하고, 황소자리는 '스킨십'과 '선물'을 선호합니다. 물고기자리의 '이상적인 사랑'을 황소자리가 '현실적인 행동'으로 채워주는 것이 중요합니다.",
        "conflictStyle": "주로 '침묵 대 침묵'의 형태입니다. 둘 다 말로 싸우기보다 서운함을 삭이는 스타일입니다. 황소자리의 묵묵함과 물고기자리의 도피가 합쳐져 문제 해결이 가장 어려운 커플입니다.",
        "relationshipGoals": "안락하고 아름다운 집, 평화로운 일상, 그리고 깊은 감성적인 교류를 목표로 합니다. 경제적 안정과 정서적 안정이 최우선입니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "황소자리(MY)가 기억해야 할 조언: 말로 표현하라",
        "forMyType_Tips": [
            "물고기자리의 '꿈'과 '비현실적인 이야기'를 현실로 비판하지 마세요. 그들의 감성을 존중하고 공감해 주는 것이 중요합니다.",
            "물고기자리의 헌신적인 행동에 대해 '말'로 감사를 표현해야 합니다. 묵묵히 받아들이기만 하면 물고기자리가 지칩니다.",
            "문제가 생겼을 때, 침묵하지 말고 '지금은 생각 중이다'라고 언어적으로 표현해 주어야 물고기자리가 불안해하지 않습니다."
        ],
        "forPartnerType_Header": "물고기자리(PARTNER)가 기억해야 할 조언: 현실을 직시하라",
        "forPartnerType_Tips": [
            "황소자리의 '고집'을 '안정적인 신뢰'로 해석하고, 그들의 느린 속도를 믿고 따라야 합니다.",
            "서운한 감정이 생겼을 때, 억지로 참거나 '희생'하지 말고 '솔직히 기분이 좋지 않다'고 짧게라도 표현하는 훈련을 해야 합니다.",
            "황소자리와 함께 '재정 계획'이나 '집안일 분담' 등 현실적인 책임을 나누는 노력이 필요합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "물고기자리가 '창의적인 아이디어'와 '공감'을 제공하고, 황소자리가 '예산 관리'와 '운영 안정화'를 맡습니다. 감성과 현실을 결합하는 데 효과적입니다.",
        "onAVacation": "여행의 목적은 '힐링'과 '미식'입니다. 5성급 리조트, 최고의 음식, 그리고 편안한 환경을 선호합니다. 물고기자리의 감성적인 요구를 황소자리가 현실적으로 채워줍니다.",
        "asParents": "아이에게 물질적인 안정과 헌신적인 사랑(황소자리)을 제공하고, 아이의 상상력과 감성(물고기자리)을 키워주는 부모입니다. 아이의 정서적 안정에 최선을 다합니다."
    }
}
