{
    "score": 85,
    "title": "벽돌과 벽돌의 만남, 절대 깨지지 않는 철옹성 커플",
    "summary": "두 황소자리(Taurus)가 만났을 때, 세상은 멈춘 듯 평화롭고 안정적입니다. 황소자리는 안정, 신뢰, 그리고 오감을 통한 만족(미식, 예술, 물질)을 추구하는 '흙'의 별자리입니다. 두 사람은 서로의 가치관과 느린 속도를 완벽하게 이해하며, 상대방의 변화에 대한 거부감을 전혀 비난하지 않습니다.\n\n이는 궁합 점수가 매우 높은 이유이기도 합니다. 하지만 이 안정감이 때로는 **'지루함'**과 **'고착화된 습관'**으로 변질될 수 있습니다. 관계에 새로운 자극이 전혀 없으며, 누가 먼저 움직여야 할지 모르는 **'무한 침묵'**에 빠질 위험이 있습니다. 둘 다 고집이 강해 한번 틀어지면 화해하는 데 몇 주가 걸릴 수 있습니다.",
    
    "analysis": {
        "strengths": [
            "최고의 안정감: 둘 다 급격한 변화를 싫어하고 편안한 일상을 중요하게 여겨, 매우 안정적이고 예측 가능한 관계를 유지합니다.",
            "물질적 풍요와 감각적 만족: 둘 다 미각, 촉각 등 감각적인 즐거움을 중시하고 돈 관리 능력이 뛰어나, 럭셔리하고 풍요로운 삶을 함께 추구합니다.",
            "강한 충성심과 신뢰: 한번 마음을 주면 절대 변하지 않습니다. 서로에게 깊은 신뢰를 가지고 오랫동안 관계를 지속합니다."
        ],
        "weaknesses": [
            "타협 불가능한 고집: 문제가 생겼을 때, 서로 물러서지 않고 묵묵히 버티는 '침묵의 고집' 때문에 관계가 정체되고 소통이 단절될 수 있습니다.",
            "지루함과 정체: 변화를 극도로 싫어하는 성향 때문에 관계가 매너리즘에 빠지기 쉽습니다. 새로운 활력을 불어넣을 외부 자극이 필요합니다.",
            "소유욕과 질투: 둘 다 상대방에 대한 소유욕이 강하고, 가끔은 상대의 움직임이나 돈 씀씀이에 질투를 느낄 수 있습니다."
        ]
    },
    
    "deepDive": {
        "loveLanguage": "주로 '봉사(Acts of Service)'와 '선물(Gifts)'입니다. 상대방이 좋아하는 음식을 정성껏 만들어주거나, 고가의 가구나 예술품을 선물하는 행위를 통해 사랑을 느낍니다. 스킨십도 중요하지만, 매우 부드럽고 편안한 형태를 선호합니다.",
        "conflictStyle": "극도의 침묵(Stone Walling)입니다. 둘 다 말로 싸우기보다는 입을 닫고 버티는 스타일입니다. 이로 인해 갈등이 해결되지 않고 무기한 연기되는 경우가 많습니다. '시간이 해결해 주겠지'라는 태도가 문제입니다.",
        "relationshipGoals": "안락하고 아름다운 집을 장만하고, 맛있는 음식을 함께 먹으며 여유로운 삶을 사는 것. 경제적 안정과 물질적 풍요가 최우선 목표입니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "황소자리(MY)가 기억해야 할 조언: 먼저 움직여라",
        "forMyType_Tips": [
            "상대방의 고집이 느껴진다면, 당신이 먼저 '왜 그런지' 물어보고 고집을 푸는 쪽이 되어야 합니다. 둘 다 침묵하면 관계가 파괴됩니다.",
            "가끔은 '계획 없는' 즉흥적인 데이트나 여행을 시도해 보세요. 관계에 필요한 활력은 당신의 변화에서 시작됩니다.",
            "돈을 쓰는 문제나 생활 습관에서 당신의 방식을 '절대적 기준'으로 내세우지 말고, 상대의 합리적인 지출 방식을 존중해 주어야 합니다."
        ],
        "forPartnerType_Header": "황소자리(PARTNER)가 기억해야 할 조언: 변화를 즐겨라",
        "forPartnerType_Tips": [
            "싸움이 발생했을 때, 감정을 묵히지 말고 '솔직히 기분이 상했다'는 것을 짧게라도 표현하는 훈련을 해야 합니다.",
            "상대방의 물질적 취향이나 감각을 존중하세요. 당신과 다르다고 해서 '틀린 것'이 아닙니다.",
            "두 사람의 관계가 지루해졌다고 느낄 때, 상대방에게 '새로운 취미'나 '작은 변화'를 제안하고 함께 움직여야 합니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "최고의 '부동산 투자' 파트너. 한 명은 매물을 찾고, 다른 한 명은 가치를 분석합니다. 함께하면 재정적으로 매우 안정적인 결과를 얻을 수 있습니다.",
        "onAVacation": "5성급 호텔, 최고의 음식점, 스파, 갤러리 방문 등 편안함과 고급스러움을 추구하는 여행을 선호합니다. 여행의 목적은 '휴식'과 '미식'입니다. 힘든 액티비티는 피합니다.",
        "asParents": "아이에게 물질적인 안정과 예술적 감각, 그리고 꾸준함을 가르치는 부모입니다. 아이에게 충분한 인내심을 가지고 교육합니다."
    }
}
