// [파일 이름: /data/mbti/INFP-ENFJ.json]
// (이것은 JS가 아닌 JSON 파일입니다. 키와 문자열을 ""로 감싸야 합니다.)
{
    "score": 95,
    "title": "영혼의 동반자, 이상과 현실을 잇는 다리",

    "summary": "INFP의 섬세하고 깊은 이상주의적 세계관을, ENFJ가 따뜻한 공감 능력과 뛰어난 현실 감각으로 지지하고 실현시켜주는 '영혼의 동반자' 조합입니다. 서로가 서로의 잠재력을 최고로 이끌어내며 함께 성장하는, 가장 이상적인 관계 중 하나입니다.\n\nINFP는 ENFJ를 통해 자신의 막연한 꿈이 현실이 되는 것을 경험하며, ENFJ는 INFP의 순수함과 깊이에서 잊고 있던 삶의 의미와 영감을 되찾습니다. 이들은 단순한 연인을 넘어, 서로에게 '구원'이자 '뮤즈'이며, 가장 헌신적인 '가이드'가 되어줍니다.",

    "analysis": {
        "strengths": [
            "깊은 정서적 교감: 두 유형 모두 감정(F)을 중시하며, 말하지 않아도 서로의 감정을 깊이 이해하고 공감합니다. 이들의 대화는 피상적인 수준을 넘어 '영혼'의 대화로 이어집니다.",
            "상호 보완적 성장: INFP는 ENFJ를 통해 현실 감각과 추진력을 배우고, ENFJ는 INFP를 통해 내면의 깊이와 순수한 이상을 되찾습니다. ENFJ는 INFP의 '날개'가 되어주고, INFP는 ENFJ의 '뿌리'가 되어줍니다.",
            "공동의 가치관: '더 나은 세상', '사람들을 돕는 일', '진정성' 등 공동의 가치를 추구하기 때문에 관계의 목표가 뚜렷하며, 함께 더 큰 선을 이룰 수 있습니다."
        ],
        "weaknesses": [
            "극심한 갈등 회피 성향: 두 유형 모두 갈등을 '악'으로 규정하는 경향이 있습니다. 서운한 점을 솔직하게 말하지 않고 쌓아두다 한 번에 터지거나, 한쪽이 관계를 포기할 수 있습니다.",
            "ENFJ의 과도한 부담: ENFJ는 '리더'이자 '보호자'로서 관계를 이끌어야 한다는 부담감에 쉽게 지칠 수 있습니다. INFP를 '보호해야 할 대상'으로만 보다가 관계의 균형이 무너질 수 있습니다.",
            "INFP의 '동굴' 잠수: INFP는 스트레스를 받으면 혼자만의 '동굴'로 들어갑니다. 이때 외향적(E)이고 관계지향적인 ENFJ는 '자신이 버려졌다'고 느끼며 극도의 상처와 불안을 느낄 수 있습니다."
        ]
    },

    "deepDive": {
        "loveLanguage": "INFP는 '진심이 담긴 칭찬(Words of Affirmation)'과 '오붓한 둘만의 시간(Quality Time)'을 통해 사랑을 느낍니다. ENFJ 역시 '칭찬(Words of Affirmation)'에 매우 감동하며, '봉사(Acts of Service)'를 통해 사랑을 적극적으로 표현합니다. 두 사람 모두 물질적인 선물(Gifts)보다는, 서로의 존재 자체를 인정하고 지지해 주는 '말' 한마디에 가장 큰 사랑을 느낍니다.",
        "conflictStyle": "싸웠을 때가 가장 큰 위기입니다. INFP는 갈등 상황에서 '회피'하거나 '침묵'하며 자신의 '동굴'로 숨어버립니다. (Flee) 반면 ENFJ는 문제를 '즉시' 해결하고 싶어 하며 '대화'를 시도합니다. (Face) INFP의 침묵을 ENFJ가 '거절'로 받아들이는 순간, ENFJ는 패닉에 빠지고 관계는 급격히 나빠집니다. 이들은 '싸우는 법'을 반드시 배워야 합니다.",
        "relationshipGoals": "이 커플의 목표는 '함께 성장하여 세상을 바꾸는 것'입니다. 단순한 연애를 넘어, 서로의 꿈을 지지하고 응원하며 '더 나은 사람'이 되는 것을 관계의 가장 큰 보상으로 여깁니다. 둘이 함께라면 1+1=2가 아니라 100이 될 수 있다고 진심으로 믿습니다."
    },
    
    "actionableAdvice": {
        "forMyType_Header": "만약 당신이 INFP라면 (ENFJ 공략법)",
        "forMyType_Tips": [
            "당신의 ENFJ를 '세상에서 가장 멋진 영웅'처럼 칭찬해주세요. ENFJ는 칭찬과 인정을 먹고 자랍니다. 당신의 진심 어린 감탄(예: '너 덕분에 내가 더 나은 사람이 되는 것 같아')은 ENFJ를 춤추게 합니다.",
            "ENFJ가 현실적인 조언을 할 때, '나를 통제한다'고 생각하지 말고 '나를 도와주려는 진심'으로 받아들여주세요. ENFJ는 당신의 꿈을 짓밟으려는 게 아니라, 그 꿈을 '실현'시켜주고 싶을 뿐입니다.",
            "혼자만의 시간이 필요할 땐, 그냥 잠수 타지 말고 '나 생각할 시간이 딱 1시간만 필요해. 1시간 뒤에 다시 얘기하자'라고 '구체적인' 시간을 꼭 말해주세요. 이것만으로도 ENFJ의 불안감을 90% 해소할 수 있습니다."
        ],
        "forPartnerType_Header": "만약 당신이 ENFJ라면 (INFP 공략법)",
        "forPartnerType_Tips": [
            "INFP의 엉뚱한 상상이나 비현실적인 꿈을 '귀엽다'고 무시하지 말고, '정말 멋진 생각이다! 그 얘기를 좀 더 자세히 해줄래?'라고 진심으로 감탄해주세요. INFP는 자신의 내면을 알아봐 주는 사람에게 영혼을 바칩니다.",
            "INFP를 '고쳐야 할 대상'이나 '이끌어야 할 아이'로 보지 마세요. INFP는 당신의 '동등한 파트너'입니다. '내가 널 위해 이렇게 해줄게'보다 '우리가 함께 이걸 해보면 어떨까?'라고 말해주세요.",
            "INFP가 '동굴'에 들어갔을 땐 억지로 끌어내려 하지 마세요. '네가 준비되면 언제든 이야기 들어줄게'라는 따뜻한 쪽지나 메시지를 남기고 조용히 기다려주는 것이 INFP에게 가장 큰 사랑의 표현입니다."
        ]
    },
    
    "funScenarios": {
        "workRelationship": "신규 프로젝트 팀의 '드림팀'입니다. INFP가 '사람들의 마음을 울릴' 창의적인 아이디어를 제안하면, ENFJ가 그 아이디어에 논리적인 근거를 붙이고 사람들을 설득하여 프로젝트를 추진력 있게 이끌어갑니다. INFP는 ENFJ의 리더십을 신뢰하고, ENFJ는 INFP의 창의력을 존중합니다. '비전'과 '실행력'을 모두 갖춘, 이상적인 파트너입니다.",
        "onAVacation": "INFP는 '한적한 숲속 오두막에서 책 읽기' 같은 감성적인 여행을, ENFJ는 '현지인들과 교류하는 봉사활동' 같은 의미 있는 여행을 계획합니다. 둘의 계획을 합쳐 '조용한 시골 마을에서 현지인 돕기' 같은 멋진 여행을 만들 수 있습니다. ENFJ는 꼼꼼하게 일정을 짜고, INFP는 그 일정 속에서 예상치 못한 감동의 순간을 발견해낼 것입니다."
    }
}
